{"Spirit_Breaker": ["Ghost Scepter (and it's upgrade Ethereal Blade) prevents Spirit Breaker from right clicking and bashing.", "Eul's Scepter of Divinity can be used on yourself or Spirit Breaker to cancel Charge of Darkness and Nether Strike.", "Rod of Atos, Scythe of Vyse, Abyssal Blade, and Force Staff (and its upgrade Hurricane Pike) interrupt Charge of Darkness.", "Heaven's Halberd can prevent Spirit Breaker from right clicking and bashing.", "Linken's Sphere blocks Charge of Darkness and Nether Strike."], "Lina": ["Infused Raindrops can keep you alive against Lina's magic burst damage in the early game.", "Black King Bar prevents Lina from using her abilities to kill you until she gets an Aghanim's Scepter.", "Eul's Scepter of Divinity can dodge her abilities.", "Blade Mail can be used to reflect Lina's burst damage back to her.", "Linken's Sphere blocks Laguna Blade.", "Lotus Orb can reflect Laguna Blade."], "Phoenix": ["Black King Bar, as mentioned, will nullify Phoenix against its spell immune wielder.", "Orchid Malevolence and Bloodthorn, as mentioned earlier with silences, will prevent Phoenix from escaping or retaliating, but will also make it more vulnerable to damage thanks to its damage amplification.", "Scythe of Vyse is a more dangerous version of the formerly mentioned items. Not only does its active, Hex, silence abilities, but it will also mute items, preventing Phoenix from dispelling it if it has Lotus Orb or Eul's Scepter of Divinity.", "Moon Shard can turn any hero into a severe threat as its granted high attack speed can spell the end for a misplaced Supernova.", "Similar in nature, Echo Sabre can be an early game threat to the Phoenix Sun, especially if it is only level 1, as it takes only 5 hits to kill the Sun.", "Pipe of Insight will make a whole enemy team more resilient against Phoenix's DPS."], "Invoker": ["Pipe of Insight significantly reduces Invoker's damage output.", "Black King Bar prevents nearly all of Invoker's damage for its duration.", "Eul's Scepter of Divinity allows you to completely negate a Eul combo from Invoker, although any smart Invoker will wait for you to use your Eul first before using his combo.", "Glimmer Cape is a cheaper alternative to reduce Invoker's damage.", "Blade Mail can easily kill Invoker if he does the Chaos Meteor and Tornado combo.", "Force Staff can be used to save oneself and allies from Invoker's combos.", "Diffusal Blade can be used to burn Invoker's mana pool."], "Monkey_King": ["Tango, Quelling Blade, and Battle Fury can destroy the tree Monkey King is standing on.", "Force Staff pushes Monkey King out of Wukong's Command. Pushed heroes can also destroy trees.", "Orb of Venom's damage over time keeps Monkey King from using Tree Dance for the duration in the early game.", "Dragon Scale, Urn of Shadows, and Spirit Vessel keeps Tree Dance on cooldown.", "Radiance's area burn will reveal Monkey King when he is disguised with Mischief while also putting his Tree Dance on cooldown constantly until he leaves the area, greatly cutting down his escape options. In addition, the blind proves problematic and makes it harder for him to gain and land Jingu Mastery stacks.", "Eul's Scepter of Divinity dispels Jingu Mastery's buff.", "Shiva's Guard will reveal Monkey King when he is on a tree."], "Meepo": ["Black King Bar can protect a hero from Poof and Earthbind.", "Butterfly greatly improves survivability against Meepo, as he can't effectively counter evasion.", "Scythe of Vyse, Orchid Malevolence, and Abyssal Blade can disable a lone Meepo from escaping with Poof.", "Manta Style, Lotus Orb, and Guardian Greaves can dispel Earthbind on allies or yourself."], "Chaos_Knight": ["Shiva's Guard provides armor and a negative attack speed aura, reducing the damage output of Chaos Knight and his illusions, and can slow and damage them with Arctic Blast.", "Blade Mail is a great item when timed right to destroy all the illusions instantly and it does a great job in countering Chaos Knight's high damage output in general.", "Butterfly allows heroes to evade Chaos Knight's attacks, reducing his damage output.", "Ghost Scepter and Ethereal Blade prevent Chaos Knight from focusing down a target by turning it ethereal.", "Manta Style creates illusions that can make it difficult for Chaos Knight to initiate on the real hero.", "Linken's Sphere prevent Chaos Knight from using his targeted skills effectively.", "Battle Fury provides cleave damage, which is especially helpful to destroy Chaos Knight's illusions for melee heroes relying on attack damage."], "Bloodseeker": ["Town Portal Scroll will often prevent Bloodseeker's ganking attempts, as he has no disables to interrupt it.", "Magic Stick gains charges as Bloodseeker is often using Bloodrage to farm in lane.", "Blade Mail can reflect damage from Rupture. Strength heroes with mobility skills such as Clockwerk or Centaur Warrunner can reflect large amounts of damage when Ruptured.", "Linken's Sphere blocks Rupture.", "Crimson Guard lowers Bloodseeker's damage, making it difficult for his Thirst bonus to kick in.", "Heart of Tarrasque's health regeneration reduces Thirst's effectiveness.", "Lotus Orb reflects Rupture.", "Guardian Greaves dispels Blood Rite's silence and keeps any heroes from giving Bloodseeker a Thirst bonus."], "Bane": ["Linken's Sphere blocks any of Bane's targeted abilities, which are all single-target.", "Abyssal Blade can disable the channelling of Fiend's Grip even through spell immunity.", "Black King Bar's spell immunity protects the user from all of Bane's abilities except Fiend's Grip and Brain Sap with Aghanim's Scepter.", "Lotus Orb reflects all of Bane's single target abilities, and can disable him instead."], "Pugna": ["Force Staff allows for someone to quickly escape a Life Drain for a very small mana cost. With quick fingers, you can also dodge Nether Blast.", "Glimmer Cape and Pipe of Insight both reduces Pugna's damage output considerably.", "Pugna's only tool against Black King Bar is a defensive Decrepify.", "Blink Dagger is great versus Pugna as he hates being jumped on because of his extremely fragile nature.", "Linken's Sphere can block Life Drain and Decrepify.", "Lotus Orb reflects Life Drain and Decrepify.", "Nullifier dispels Decrepify.", "Eul's Scepter of Divinity dispels Decrepify and can be used to dodge Nether Blast."], "Phantom_Lancer": ["Both Aeon Disk and Crimson Guard will completely negate the damage of Phantom Lancer's illusions, even when Phantom Lancer has a considerable farm.", "Battle Fury's cleave damage helps destroy Phantom Lancer's illusions.", "Heaven's Halberd prevents Phantom Lancer from proccing Juxtapose places an undispellable debuff which helps identify the real Phantom Lancer.", "Radiance's burn aura helps destroy Phantom Lancer's illusions, and its blind chance provides some protection from Diffusal Blade's mana burn.", "Silver Edge breaks Juxtapose and Phantom Rush and places undispellable debuff which helps identify the real Phantom Lancer.", "Maelstrom and Mjollnir's chain lightning helps clear Phantom Lancer's illusions.", "Orchid Malevolence and Bloodthorn indirectly locks down Phantom Lancer by preventing him from using Doppelganger to disjoint or dispel.", "Shiva's Guard helps clear out Phantom Lancer's illusions. The passive aura and active slow reduce Phantom Lancer's attack speed and regeneration.", "Magic Wand helps his victims get off an escape ability.", "Nullifier reveals the real hero as it is not dispellable and negates the safety of his many illusions, so the enemy can focus him down.", "Gleipnir's AoE root prevents Phantom Lancer and his illusions from using Doppelganger."], "Skywrath_Mage": ["Black King Bar, Pipe of Insight and Glimmer Cape mitigate or remove your damage.", "Blade Mail reflects a lot of damage back to you.", "Black King Bar, Manta Style, Lotus Orb dispel your silence and Concussive Shot slow.", "Three standard support items work very well against Skywrath Mage, but a good and snowballing Skywrath can work around them.", "Although Force Staff will save you or an ally from Mystic Flare, a squishy support will still die from a couple of amplified Arcane Bolts, especially once affected by Ancient Seal. Force Staff won't disjoint Concussive Shot, so Skywrath Mage should have vision to cast his other spells.", "Similarly, Eul's Scepter of Divinity will protect you from the damage of Mystic Flare, as well as dispelling the silence of Ancient Seal and the slow of Concussive Shot, but a smart Skywrath will keep his silence for after the Cyclone.", "Finally, Glimmer Cape's active ability helps to survive his combo, but if he carries a Dust of Appearance it might not be enough, since the magic resistance is countered by the spell amplification of Ancient Seal.", "Any combination of the two should allow any support to survive.", "Orchid Malevolence or its upgrade Bloodthorn prevents Skywrath Mage from casting spells, and the latter is especially deadly for Skywrath Mage, as it amplifies physical damage he takes.", "Infused Raindrops blocks a portion of Skywrath Mage's arsenal of magic damage."], "Luna": ["Items which allow the enemy to go invisible, such as Glimmer Cape and Shadow Blade. Silver Edge will also disable Moon Glaives as an added effect.", "Because of Luna's low HP and strong indiscriminate AoE damage, Luna suffers greatly from the Last Will of the Necronomicon warrior.", "Vanguard/ Abyssal Blade/ Crimson Guard greatly reduce damage from bouncing glaives."], "Puck": ["Black King Bar blocks all damage received from Puck.", "Scythe of Vyse locks down Puck before it can slip away.", "Orchid Malevolence shuts down any escapes with Illusory Orb.", "Nullifier disables Puck's Eul's Scepter of Divinity and Blink Dagger, making it much easier to lock down.", "Dagon's instant projectile and burst damage can kill Puck before Phase Shift."], "Templar_Assassin": ["Radiance and Urn of Shadows (as well as Spirit Vessel) can waste Templar Assassin's Refraction charges and keep burning her down during Meld. In addition, these items can also prevent Templar Assassin to escape with her Blink Dagger.", "Items that grant True Sight: Dust of Appearance (she can dispel it with her talent), Gem of True Sight, Sentry Ward, Book of the Dead.", "Items that can waste her ganking attempt: Ghost Scepter is a very good choice against her since she relies almost entirely on physical damage, also Ghost Scepter and Eul's Scepter of Divinity can buy you precious time to TP away since she has no hard disable to pin her victim down. Force Staff can make some distance with her, but unless you are able to force onto high ground, her Psionic Trap will help her catch up easily."], "Leshrac": ["Black King Bar ignores all magical damage from Leshrac.", "Blade Mail reflects Leshrac's high damage.", "Diffusal Blade drains mana from Leshrac."], "Sniper": ["Blade Mail returns all the damage Sniper deals, and the duration of it is often more than enough to either kill Sniper, or leave him low on HP.", "Eul's Scepter of Divinity can disjoint Assassinate if timed correctly, as you have ~4 seconds to react before being hit.", "Smoke of Deceit disables True Sight from Assassinate on target.", "Linken's Sphere blocks Assassinate on impact.", "Blink Dagger capable of closing gap between user and Sniper very fast and disjointing Assassinate.", "Lotus Orb reflects Assassinate."], "Batrider": ["Linken's Sphere will block Flaming Lasso, forcing Batrider to waste an item like Force Staff or Eul's Scepter of Divinity on the target just to use Lasso.", "Lotus Orb will cause Batrider to also Lasso himself, preventing him from dragging the enemy away.", "Aeon Disk will dispel Flaming Lasso and protect the target for a few seconds giving him a chance to survive.", "Magic Stick and Magic Wand will accumulate charges very quickly against a Batrider spamming Sticky Napalm in lane.", "Phase Boots can increase turn rate to counter Sticky Napalm.", "Blade Mail can reflect damage from Firefly, even if the heroes who carry them are not target for Flaming Lasso.", "Mage Slayer will cause Firefly, Flamebreak and Flaming Lasso to do 35% less spell damage, making Batrider deal significantly less damage to enemies."], "Broodmother": ["Spirit Vessel disables Broodmother's regeneration for a good amount of time.", "Blink Dagger, followed by a disable, can catch Broodmother in the trees.", "Boots of Travel intercepts Broodmother's split pushing attempts.", "Vanguard, Crimson Guard, and Abyssal Blade negate a majority of the Spiderlings' damage.", "Radiance, Battle Fury, Maelstrom, and Mjollnir wipe out many Spiderlings quickly.", "Diffusal Blade and Rod of Atos stop Broodmother from getting away."], "Elder_Titan": ["Raw armor or magic resistance", "Aeon Disk can nullify your combo's damage and make the targets hard to finish off.", "Items with instant stuns, disables or silences allow you to cancel the Echo Stomp:", "Scythe of Vyse", "Abyssal Blade", "Eul's Scepter of Divinity", "Orchid Malevolence (and Bloodthorn)", "Mobility Items allow you to escape from the Echo Stomp or Earth Splitter radius:", "Blink Dagger", "Force Staff (and Hurricane Pike)", "Items that give raw armor to you and your teammates:", "Medallion of Courage (and Solar Crest)", "Assault Cuirass", "Shiva's Guard"], "Chen": ["Shiva's Guard will greatly hinder the converted creeps' damage output, while the slow from Arctic Blast will make Chen and his creeps easy targets.", "Dagon's Burst damage can quickly finish off Chen's teammates before he is able to use Hand of God.", "Battle Fury allows melee heroes to destroy converted creeps.", "Maelstrom and Mjollnir allows ranged heroes to destroy converted creeps.", "Hand of Midas instantly kills converted creeps, and grants farm in process.", "Black King Bar blocks the abilities of both Chen and his creeps.", "Manta Style dispels Penitence and can make Chen waste spells on illusions.", "Shadow Blade allows heroes to bypass Chen's creeps and pick him off.", "Helm of the Dominator can take control of converted creeps.", "Radiance will deal area damage to all of Chen's converted creeps.", "Spirit Vessel provide an AOE healing reduction, effectively reduce the healing from Divine Favor and Hand of God"], "Rubick": ["Black King Bar prevents you from doing anything to a hero other than stealing spells, unless you have stolen a spell that can pierce spell immunity.", "Linken's Sphere prevents stealing a spell but Rubick may use his failed steal or other spells to break the Spellblock.", "Diffusal Blade will wear down Rubick's mana pool, preventing him from spamming his abilities, as well as any stolen spells."], "Mirana": ["Gem of True Sight and Sentry Ward reveal her and her team during Moonlight Shadow.", "Observer Wards scout her rotations, which lower a roaming Mirana's impact on the laning stage.", "Black King Bar prevents her whole combo from working, and Glimmer Cape or Pipe of Insight can be used to protect an ally hit by Sacred Arrow.", "Manta Style makes Sacred Arrow much harder to land because of illusions and the brief invulnerability."], "Morphling": ["Monkey King Bar - As Morphling rarely builds any sort of magic resistance aside from Black King Bar, which Monkey King Bar pierces, the high magic damage from its Pierce passive is more effective than most physical damage items.", "Pipe of Insight and Hood of Defiance reduce the damage from Ethereal Blade and Adaptive Strike (Agility) combo", "Orchid Malevolence and Bloodthorn - Both items can silence Morphling, preventing him from using his abilities to survive and/or escape. The latter also amplifies physical damage Morphling takes, and provides True Strike if Morphling has Butterfly.", "Heaven's Halberd places an undispellable disarm on Morphling, forcing him to resort to his nukes to deal damage.", "Spirit Vessel reduces the health Morphling gains using Attribute Shift (Strength) by 60%.", "Scythe of Vyse fully disables Morphling and allows the enemy team to burst him down.", "Blink Dagger allows heroes with stun abilities to close gaps and disable Morphling before he can shift into strength: Axe, Earthshaker, Legion Commander, Lion, Outworld Destroyer, Shadow Shaman, Slardar."], "Phantom_Assassin": ["Monkey King Bar grants accuracy to counter Blur.", "Maelstrom and Mjollnir's Chain Lightning can pierce through Blur.", "Blade Mail turns Phantom Assassin's massive burst damage against her, dissuading her from attacking.", "Bloodthorn makes her a more vulnerable target thanks to its accuracy, damage amplification, and critical strikes. In addition, the silence prevents her from initiating effectively, being unable to use her Stifling Dagger and Phantom Strike, making her susceptible to kiting.", "Scythe of Vyse completely removes Phantom Assassin's chances of escape. As Hex also disables item usage, even if she purchases Black King Bar, if the Hex is applied before she can activate it, she may fall down very easily once further disabled and nuked down.", "Silver Edge breaks Blur. and Coup de Grace, severely crippling her damage and survivability.", "Ghost Scepter prevents Phantom Assassin from attacking, making it good protection item for casters. It can be upgraded to Ethereal Blade later, which can be used on allies, or to nuke and disarm Phantom Assassin.", "Glimmer Cape can be used to save targets hit by Phantom Assassin's crits. However, it is not advised if your team already has invisible heroes as enemies will then most likely carry Dust of Appearance all the time.", "Solar Crest not only melts Phantom Assassin's armor, it also reduces her attack speed from Phantom Strike.", "Heaven's Halberd disarms Phantom Assassin, preventing her from proccing Coup de Grace.. Its evasion also provides reliable protection against her physical attacks."], "Ember_Spirit": ["Orchid Malevolence and Bloodthorn can be devastating for Ember Spirit, as silences prevent him from getting Activate Fire Remnant off. Ember Spirit is quite fragile as well, so additional damage from these items will be very helpful. It will probably force Ember Spirit to get Manta Style or Black King Bar as well, which will limit his late game damage potential.", "Abyssal Blade and Scythe of Vyse are both strong disables, preventing Ember Spirit from easily escaping.", "Assault Cuirass and Crimson Guard greatly decrease Ember Spirit's damage output from regular attacks and Sleight of Fist.", "Butterfly and Heaven's Halberd allow enemy heroes to survive longer against Ember Spirit because of the evasion bonus and the disarm in Heaven's Halberd's case.", "Satanic, Heart of Tarrasque, and Eye of Skadi are all items that will allow enemies to survive Ember Spirit's late game AoE damage from Sleight of Fist. Additionally, Heart of Tarrasque will allow enemies to repeatedly breach Ember Spirit's highground without committing any resources.", "Eul's Scepter of Divinity can be tactically used to lock Ember down, dispelling his Flame Guard, and being followed by another disable."], "Earth_Spirit": ["Black King Bar blocks all of Earth Spirit's abilities.", "Pipe of Insight greatly reduces magical damage in a big area, making it hard for Earth Spirit to deal significant damage.", "Items that can dispel debuffs: Eul's Scepter of Divinity, Manta Style, Guardian Greaves, Lotus Orb"], "Windranger": ["Rod of Atos, Eul's Scepter of Divinity and Abyssal Blade prevents Windranger from escaping with Windrun.", "Orchid Malevolence/ Bloodthorn and Scythe of Vyse can greatly reduce Windranger's performance due to her relying heavily on her skills for any tactical advantage.", "Linken's Sphere works against Focus Fire and Shackleshot.", "Blade Mail can be used to return Windranger's Focus Fire damage.", "Nullifier is exceptionally useful against windrunner's who go aghanims as it will remove windrun from her persistently, and her extra charges become useless.", "Heaven's Halberd can save you or your teammate from lot of damage from Focus Fire."], "Abaddon": ["Orchid Malevolence and Bloodthorn make a supporting Abaddon useless at crucial moments.", "Eul's Scepter of Divinity wastes some duration of Borrowed Time.", "Silver Edge disables Curse of Avernus and Borrowed Time's passive component. When used in combination with Orchid Malevolence, Bloodthorn, or another silence, Borrowed Time will not trigger at all.", "Dagon and Ethereal Blade can kill Abaddon before he uses Borrowed Time, forcing him to cast it manually.", "Spirit Vessel and Shiva's Guard decreases the amount of healing from Borrowed Time."], "Bounty_Hunter": ["Dust of Appearance is the typical counter against Bounty Hunter's Shadow Walk. Early game, this item can easily guarantee a kill on Bounty Hunter if he is invisible as he may not have a means of removing his invisibility safely (thus receiving the 20% movement slow).", "Sentry Wards can act as repellent if he knows of their place or as a trap if he doesn't.", "Gem of True Sight is a powerful deterrent against his roaming.", "Guardian Greaves, Lotus Orb, Black King Bar, Eul's Scepter of Divinity and Manta Style are good for removing Track, in addition to their other useful effects.", "In Lotus Orb's case, it may also be used to reflect Track back towards Bounty Hunter, revealing him and hastening any ally near him."], "Oracle": ["A Black King Bar on an enemy will prevent Oracle from using his burst damage and utility on that enemy. Additionally, a Black King Bar on an ally will prevent Oracle from healing or protecting that ally with his spells, except False Promise and Fortune's End.", "Orchid Malevolence prevents Oracle from using any spells, including Fortune's End, which would otherwise allow him to dispel it.", "Orchid's effect is mitigated with a dispelling effect like Eul's Scepter of Divinity.", "Items providing magic resistance like Hood of Defiance or Glimmer Cape will drastically reduce Oracle's damage output.", "Dispelling effects such as Manta Style render Fortune's End and Fate's Edict useless on enemies.", "Scythe of Vyse applies hex on Oracle, making him unable to save allies even more."], "Riki": ["Items with True Sight are always a threat:", "Sentry Ward is a traditional item to counter heroes like Riki, discourage him to go alone and force an investment in detection for his own team.", "Dust of Appearance not only reveals Riki, but also slows his movement speed which put him in a very vulnerable state since he cannot turn off Cloak and Dagger. This will force him to invest on a Manta Style.", "Gem of True Sight is a nightmare for Riki, heavily discouraging him to go roam in dark area or follow an enemy.", "Book of the Dead, an upgraded neutral item Necronomicon can also be a threat as its summons have bonus stats aside from the Necronomicon Warrior's true sight.", "Silver Edge nullifies Cloak and Dagger, taking away half of your damage and your invisibility, making Tricks of the Trade halfway useless in the process. Still if you are able to detect Riki and land the Silver Edge in the first place, you are already on a great advantage.", "Force Staff can push the user or their allies out of Smoke Screen or Tricks of the Trade's area. Keep in mind that Riki's Blink Strike has 2 charges so he can instantly catch you up. Try to force into the highground, or instantly follow with other disable/escaping skills.", "Ghost Scepter is another great item to escape, as it prevents all physical damage from Riki and set up a safe windows to TP away.", "Shadow Blade can be used as a mean of escape, but Riki can easily counter it with Dust of Appearance, further securing the kill."], "Pudge": ["Blink Dagger is not the best choice, but can be good to escape the area faster than Meat Hook can reach.", "Lotus Orb and Linken's Sphere will prevent Dismember.", "Force Staff will be used by players to escape Pudge's Meat Hook, or, in worse conditions, escape Pudge himself after Dismember. It is also a great alternative for Blink Dagger due to increasing your mana, intelligence, and having a relatively cheaper price.", "Manta Style makes Meat Hook much harder to land because of the illusions and invulnerability duration.", "Diffusal Blade will wear down Pudge's low mana pool.", "Glimmer Cape and Shadow Blade/ Silver Edge makes Meat Hook difficult to land because of their invisibility duration.", "Eul's Scepter of Divinity can be used to cancel Pudge's Dismember and make him unavailable to fight for a while. You can also dodge hooks by using it on yourself.", "Manta Style makes it hard to land a Meat Hook."], "Techies": ["Infused Raindrops can help early against some mines.", "Sentry Wards and Gem of True Sight are key to winning against Techies.", "Observer Wards are important for catching Techies due to them rarely appearing on lane.", "Black King Bar is useful in safely pushing a high-ground against a Remote Mine/Stasis Trap defense, provided they are visible.", "Orchid Malevolence/ Bloodthorn or Scythe of Vyse are useful in taking Techies down before they can suicide.", "Heart of Tarrasque not only provides a character with more bulk against Techies' mines, but the passive regeneration can easily allow that hero to reenter another mine pit in less time than Techies can create another pit.", "Hood of Defiance, Glimmer Cape and Pipe of Insight significantly reduce the damage caused by Techies' abilities.", "Helm of the Dominator can dominate creeps and send them to defuse bombs or use them as living wards.", "Aeon Disk can be used to prevent damage from proximity mines and remote mines.", "Eul's Scepter of Divinity has the active ability \"Cyclone\" that can stop Blast Off! completely after techies leaves the ground and is in the air, wasting his ability and putting it on cooldown. Fairly quick reaction speed is needed especially if you do not know where he is going to come from. Force Staff Does the same thing but will move him as any typical usage of force staff would. Do not use either while he is charging up and has not left the ground, as he will continue to charge up and jump with no cooldown penalty if you used Eul's. Force staff will not delay the jump at all or change his targeted destination if you used it while he is still charging, instead it will help him reach his destination a little bit faster or he will simply jump backwards if you pushed him past his target destination."], "Outworld_Devourer": ["Instant healing items, such as Mekansm, Magic Stick, and Faerie Fire, can be used inside Astral Imprisonment and the healing will take effect before the damage from the prison, potentially saving the target.", "Pipe of Insight significantly reduces Sanity's Eclipse's damage.", "Black King Bar makes the user immune to all of Outworld Devourer's spells.", "When using Helm of the Dominator, an Ogre Frostmage's Ice Armor decreases Outworld Devourer's attack speed, making it hard for him to build charges and deal damage with Arcane Orb."], "Wraith_King": ["Diffusal Blade can burn Wraith King's mana quickly, preventing him from Reincarnating, until Wraith King picks up Aghanim's Shard.", "Manta Style and Illusionist's Cape are a problem to Wraith King due to his single-target abilities and lack of mobility.", "Book of the Dead summons can burn Wraith King's mana as well, preventing him from Reincarnating.", "Scythe of Vyse disables Wraith King for a good 3 seconds for him to get focus fired when defending.", "Spirit Vessel reduces the effectiveness of his self sustaining life steal making it harder for him to tank area damage.", "Eye of Skadi keeps him distant when acquired by a ranged capable hero and reduces his lifesteal abilities.", "Battle Fury and Mjollnir deal area damage to wipe out skeletons.", "Heaven's Halberd allows the user to dodge and disarm Wraith King's physical attacks when he commit a chase.", "Ghost Scepter defends against Wraith King's physical attacks but not entirely safe from magical damage Wraithfire Blasts. Must be used as a counter attack instead of last resort."], "Omniknight": ["Orchid Malevolence and other items that prevents the casting of abilities can make Omniknight useless.", "Eul's Scepter of Divinity and Nullifier can dispel Guardian Angel."], "Winter_Wyvern": ["Items that deal magical damage like Dagon and Ethereal Blade will damage through Cold Embrace.", "Ethereal Blade can be cast on ally under Winter's Curse effect wasting most of its duration. Linken's Sphere will easily block any attempt to initiate with a Winter's Curse.", "Enemies that are affected by Black King Bar will not be taunted by Winter's Curse. However, they can still be targeted directly by the spell, which may be useful to lock down key carries for a few critical seconds (e.g. a Sven that has just activated his ultimate and Black King Bar and is about to wreak havoc on your team). Additionally, Arctic Burn's and Splinter Blast's debuffs will not work."], "Tidehunter": ["Black King Bar prevents nearly all of Tidehunter's spells for its entire duration.", "Silver Edge's break can disable Kraken Shell.", "Diffusal Blade burns Tidehunter's mana pool, although the slow can be dispelled by Kraken Shell."], "Underlord": ["Force Staff will push enemies out of Firestorm, Pit of Malice, and Atrophy Aura's effective range. It can even push Underlord's teammates away from him before Dark Rift's teleport goes off.", "Diffusal Blade punishes Underlord for his low mana, and its active reduces his mobility further.", "Shiva's Guard catches Underlord's team when they gather for Dark Rift, and can be used to deal damage if caught in his Pit of Malice.", "Pipe of Insight's barrier negates pretty much all of Underlord's magical damage.", "Boots of Travel 2 can be used to defend or counter push after Underlord uses Dark Rift."], "Anti-Mage": ["Aeon Disk Is a great item for supports who wanna survive Anti-Mage's initiation with Abyssal Blade and Mana Void", "Black King Bar protects against Mana Break and Mana Void.", "Linken's Sphere blocks Mana Void, and can be used on vulnerable teammates.", "Arcane Boots and Guardian Greaves keep the team's mana high, reducing the damage from Mana Void.", "Scythe of Vyse prevents Anti-Mage from Blinking away.", "Butterfly Butterfly's evasion allows users who carry it to protect them from Anti-Mage's Mana break", "Orchid Malevolence prevents Anti-Mage from Blinking away.", "Diffusal Blade Drain's Anti Mage mana preventing him from blinking away", "Silver Edge breaks Mana Break and Counterspell's magic resistance."], "Slark": ["Force Staff, Hurricane Pike, and Force Boots allow users to break Pounce's leash.", "Black King Bar nullifies Slark's nuke damage from Dark Pact, and destroys the leash from Pounce.", "Abyssal Blade locks down Slark so he cannot escape to regenerate his health.", "Heaven's Halberd's disarm cannot be dispelled by Dark Pact, while the evasion may force Slark to build Monkey King Bar.", "Shiva's Guard gives the holder much more physical survivability and a useful active ability which will halt Slark during Shadow Dance.", "Ghost Scepter prevents Slark from attacking the holder, wasting his Pounce.", "Silver Edge's break and damage reduction cannot be removed with Dark Pact. It also disables Essence Shift.", "Scythe of Vyse's hex fully disables Slark, but hex can be dispelled with Dark Pact."], "Spectre": ["Scythe of Vyse will completely disable Spectre, and she rarely builds a Black King Bar to prevent this.", "Battle Fury will deal AoE damage and allow Spectre to be identified from her illusions.", "Mjollnir's active ability can deal a lot of damage to Spectre during a team fight, as damage from both Dispersion and Radiance will drastically increase the proc chance of Static Charge.", "Silver Edge can break both Desolate and Dispersion, crippling Spectre.", "Crimson Guard blocks most of physical damage from Dispersion."], "Clinkz": ["Dust of Appearance, Gem of True Sight and Sentry Wards are very effective against Clinkz's invisibility, though he still has high movement speed while invisible.", "Blade Mail can deal huge damage to Clinkz and it has no way to heal himself in a fight or protect against this damage with Black King Bar. Due to his high attack speed and range, Clinkz can have 3-4 attack projectiles flying at once, which are easy to reflect with Blade Mail.", "If Clinkz starts to build Orchid Malevolence or Scythe of Vyse as a source of reliable disable: Linken's Sphere can blocks these and allows his target to escape. Lotus Orb or Manta Style to dispel them.", "All of Clinkz's damage comes from his attacks. If an enemy can build high amounts of armor, such as Assault Cuirass, Clinkz becomes much less of a threat to them. Special mention goes to Shiva's Guard which also slows Clinkz's attack speed.", "After emerging from invisibility, items such as Force Staff and Hurricane Pike can be used to create distance between Clinkz and his target, preventing Clinkz from dealing damage.", "Natural counters to physical burst, including items that provide armor, Ghost Scepter or Ethereal Blade prove useful against Clinkz.", "Eul's Scepter of Divinity and Heaven's Halberd, while useful to mitigate Clinkz's attack output, cannot entirely protect your team from his Skeleton Archer."], "Visage": ["Items providing armor, like Assault Cuirass or Shiva's Guard, can protect enemies from a lot of Visage's damage. The only solution is through armor reduction like that of Solar Crest.", "Items providing evasion, like Butterfly or Heaven's Halberd, can also protect enemies from a lot of Visage's damage. The only solution is to get a Bloodthorn; Monkey King Bar will not help the Familiars.", "Black King Bar will nullify Grave Chill, Soul Assumption, and Stone Form getting rid of some of Visage's damage and all of his control.", "Vanguard and Crimson Guard will significantly drop familiar damage output.", "Radiance will make quick work of Visages' Gravekeeper's Cloak."], "Bristleback": ["Magic Stick gains many charges due to Bristleback's constant usage of Quill Spray, giving its holder an advantage in lane.", "Silver Edge disables Bristleback's passives, taking away both his tankiness as well as his damage output.", "Solar Crest reduces Bristleback's armor greatly, allowing teammates to beat him down quickly.", "Assault Cuirass' armor aura reduces Quill Spray's area damage significantly.", "Town Portal Scroll provides an easy means of escape from Bristleback, as he has no disables.", "Spirit Vessel reduces health regen and wears Bristleback down with percentage-based damage.", "Diffusal Blade burns Bristleback's mana, which lessens his ability to spam Quill Spray.", "Ghost Scepter and its upgrade Ethereal Blade provide protection against Quill Spray, and Bristleback's only means of dealing damage are through Quill Spray and basic attacks. In addition, he doesn't like purchasing dispelling items like Nullifier and Manta Style."], "Storm_Spirit": ["Orchid Malevolence (and its upgrade Bloodthorn) counters Storm Spirit, not only making him completely helpless but also dealing additional damage. Consider buying this on heroes that build a standard orchid and enjoy attacking at the same time.", "Scythe of Vyse will stop a Storm Spirit from doing anything for 3.5 seconds, giving allies enough time to nuke a Storm Spirit down or lock him down further.", "Rod of Atos's long range root will cause difficulty for a Storm Spirit when trying to escape/initiate.", "Aeon Disk is a superb item for supports who want to be able to survive storm spirits initiation."], "Ursa": ["Scythe of Vyse hexes Ursa, and even if Ursa buys an Aghanim's Scepter, he cannot dispel the hex. This leaves him very vulnerable for quite a while.", "Heaven's Halberd applies an undispellable disarm, making Ursa useless. It also gives decent evasion against his attacks.", "Aeon Disk gives an enemy hero survivability against Ursa's high initial burst attack damage, allowing the use of other abilities/items to escape before the effect ends.", "Ghost Scepter/ Ethereal Blade makes the enemy immune to Ursa's attacks, forcing him to consider buying Nullifier to dispel.", "Silver Edge breaks Fury Swipes.", "Butterfly makes Ursa harder to land Fury Swipes, forcing him to buy Monkey King Bar."], "Magnus": ["Eul's Scepter of Divinity can cancel Skewer and prevent Reverse Polarity.", "Orchid Malevolence's instant silence can prevent Reverse Polarity.", "Force Staff can cancel Skewer mid way.", "Radiance can put Magnus's Blink Dagger on cooldown.", "Rod of Atos prevents Magnus from using both Blink Dagger and Skewer."], "Dragon_Knight": ["Shiva's Guard is the primary counter against Dragon Knight, reducing his damage, move speed, and attack speed significantly.", "Mekansm negates much of Dragon Knight's damage in the early to mid game.", "Desolator, Medallion of Courage, and Solar Crest reduces much of Dragon Knight's armor."], "Tusk": ["Force Staff pushes heroes over Ice Shards and incoming Snowball.", "Lotus Orb creates a second Snowball on the Snowball target.", "Blade Mail returns the physical critical of Walrus PUNCH!", "Manta Style if timed properly, can completely negate the stun and damage of Snowball."], "Venomancer": ["Town Portal Scroll counters Venomancer as he has no disables nor nukes to stop the teleport in time.", "Pipe of Insight will heavily mitigate the effectiveness of your spells.", "Glimmer Cape as well.", "Black King Bar will nullify your spell damage for its duration.", "Blade Mail will temporarily reflect your damage back to you."], "Weaver": ["Orchid Malevolence will prevent running away with Shukuchi or Time Lapse. It can be blocked by Linken's Sphere, however.", "Items have no cast time and can be used to break Linken's Sphere.", "Abyssal Blade and Scythe of Vyse provide additional hard lockdowns.", "Shadow Amulet and any of its upgrades' invisibility can be used to neutralize The Swarm beetles.", "Sentry Ward in the early game will stop the advantages of Shukuchi and a Gem of True Sight in the late game is recommended against any invisible hero.", "Buckler and its upgrades will mitigate damage taken from The Swarm.", "Ghost Scepter makes the enemy immune to Weaver's attacks, forcing him to consider buying Nullifier to dispel."], "Undying": ["Manta Style is useful to destroy the Tombstone.", "Orchid Malevolence works very well against a spellcaster like Undying.", "Scythe of Vyse cripples Undying because he relies heavily on his abilities to stay alive in a team fight.", "Crimson Guard makes Tombstone's zombies' damage negligible in team fights with its active."], "Lion": ["Black King Bar makes all of Lion's abilities ineffective against a particular target.", "Orchid Malevolence and Bloodthorn silence Lion and thus prevent him from using his critical abilities.", "Linken's Sphere can block any of Lion's abilities, most notably Finger of Death.", "Lotus Orb reflects all of Lion's abilities, potentially stunning or hexing him or even making him burst himself down.", "Eul's Scepter of Divinity can not only catch out Lion, but it can also be used to dodge Earth Spike or even Finger of Death.", "Teams with multiple Blade Mails can cause Lion to accidentally kill himself with upgraded Finger of Death, given the right timing."], "Zeus": ["Arc Lightning and Lightning Bolt have very low cooldowns, which will provide plenty of charges for Magic Stick or Magic Wand.", "The magic resistance from Cloak, as well as it's upgrades, Hood of Defiance and Pipe of Insight, will greatly reduce the effectiveness of Zeus's abilities since they are all magical. Notice that these items have separate cooldowns and stack their magic resistance bonuses, so don't hesitate to buy a Pipe and another Hood on top if one of them is not enough. Also more than one person buying a Pipe is sometimes useful, keep in mind though that the actives don't stack.", "Glimmer Cape works as well, but keep in mind that Zeus can easily reveal you out of invisibility with Lightning Bolt and Thundergod's wrath. However, it enables the wearer to avoid Thundergod's Wrath's damage.", "Black King Bar is Zeus' worst enemy.", "Over time, Black King Bar's duration is reduced allowing Zeus to cast his spells earlier.", "Orchid Malevolence silences and amplifies the damage Zeus takes, hitting him right in his weak spots (being very dependent on spells and being a very fragile Hero).", "The enemy may also be able to build a Bloodthorn which not only silences Zeus but also takes advantage of his low armor by dealing critical damage.", "Blade Mail will return the damage Zeus deals. At the start of a fight, the percentage-based damage of Static Field can be especially harmful to Zeus.", "As an intelligence hero with a big mana pool and low armor, Diffusal Blade deals a lot of damage against him. The slow also heavily cripples his already low movement speed.", "Any invisibility item or skill negates Thundergod's Wrath damage. Invulnerability works as well.", "A special mention should go to Smoke of Deceit, since it will immediately hide you and your nearby allies from Zeus' ultimate, potentially saving your lives for a small 50 gold cost.", "Heart of Tarrasque makes it very hard to deal serious damage with magical nukes only."], "Terrorblade": ["Linken's Sphere will prevent Sunder, and Terrorblade has no solutions to waste its cooldown. In addition. Terrorblade doesn't like purchasing single-target items, which are the only solutions to pop it.", "Orchid Malevolence will prevent Terrorblade from using his abilities.", "Scythe of Vyse and Nullifier will prevent Terrorblade from using both, abilities and items.", "Maelstrom and Mjollnir are very effective at destroying illusions.", "Ethereal Blade and Dagon. are very effective at bursting down Terrorblade before he can save himself with Sunder. In addition, they are both strong against him in their own way: the former can be used to protect the targeted hero after Terrorblade uses Sunder on him/her. It can also be used to disarm Terrorblade and make him more vulnerable to magic damage (granted that he has no dispelling items), and besides Sunder, Terrorblade has no other ways of dealing damage then using direct attacks, while the latter can instantly destroy illusions upon casting and can finish real Terrorblade off before he can save himself with Sunder.", "Satanic can quickly nullify the effects of Sunder.", "Skull Basher and Abyssal Blade can prevent Terrorblade from using his abilities and attacking. This item is especially effective on heroes with high attack speed and high attack damage.", "Black King Bar allows heroes who carry it to protect themselves from Terrorblade's abilities.", "Monkey King Bar is an item that allows right-clickers to deal magical damage, that can bypass Terrorblade's high armor."], "Nature's_Prophet": ["Boots of Travel allows heroes to teleport to defend whenever Natures Prophet tries to split push.", "Quelling Blade, and its upgrade Battle Fury, allow heroes to cut down trees and allow them to escape from Sprout.", "Heaven's Halberd because Wrath of Nature is the only damage besides his basic attacks.", "Force Staff and Hurricane Pike allows heroes to escape from Sprout.", "Battle Fury, Maelstrom, Mjollnir and Radiance make it easier to clear waves of Treants"], "Nyx_Assassin": ["Detection items ( Gem of True Sight, Sentry Ward and Dust of Appearance prevent Nyx Assassin from using Vendetta to initiate or escape.", "Black King Bar blocks most of Nyx Assassin's damage.", "Eul's Scepter of Divinity can waste Nyx's Spiked Carapace, since its duration is shorter than the Cyclone's.", "Any good strength/health item like Eye of Skadi, Heart of Tarrasque or even Bloodstone can completely eliminate Nyx's solo ganking as a threat.", "Pipe of Insight protects multiple heroes from Nyx Assassin's spell damage.", "Lotus Orb discourages Nyx Assassin from targeting a hero with spells or items. However, Nyx Assassin can punish this in return with Spiked Carapace."], "Medusa": ["Diffusal Blade burns away the mana Medusa needs for Mana Shield also its active ability will slow her down.", "Blade Mail activation for a disengage can make her regret any auto attacks or Mystic Snake cast.", "Heaven's Halberd disarms Medusa for a long 5 seconds.", "Spirit Vessel slows her healing and lifesteal effects, eats away her mana pool slowly and can sustain the effects if it has stacks.", "Solar Crest removes a huge chunk of armor and adds an attack speed debuff. Slows her damage output and movement in team fights allows her to get focused also dims her durability.", "Hurricane Pike ignores her capable evasion abilities coming from items and puts a safe distance for disengaging.", "Bloodthorn ignores evasion on debuffed targets and hits the 30% chunk of damage sum along the debuff at the end of its duration.", "Monkey King Bar has an 80% chance to add bonus damage and true strike for ignoring evasion."], "Io": ["Dagon takes out Io quickly in teamfights.", "Blink Dagger allows players to jump on Io for quick kill.", "Rod of Atos shuts down Io's mobility."], "Juggernaut": ["Aeon Disk reduces damage taken from Omnislash.", "Eul's Scepter of Divinity and Ghost Scepter prevents Omnislash from hitting entirely.", "Lotus Orb can prevent Omnislash from damaging Juggernaut’s target.", "Force Staff and Hurricane Pike can break vision in rare cases and thus break Omnislash.", "Shadow Blade, Silver Edge, and Glimmer Cape can stop Omnislash if Juggernaut does not have True Sight. He can still use Dust of Appearance during Omnislash though.", "Skull Basher's and Abyssal Blade's bash pierces spell immunity, potentially preventing a Blade Fury-teleport escape.", "Manta Style creates illusions, which help tank Omnislash."], "Brewmaster": ["Black King Bar will render a hero immune to all of Brewmaster's disables.", "Monkey King Bar helps its wielder break through Brewmaster's evasion and miss chance."], "Enigma": ["Radiance's damage per second could mitigate Enigma's ability to use Blink Dagger in order to initiate.", "Eul's Scepter of Divinity can be used as a longer ranged method to cancel Black Hole provided Enigma hasn't activated his Black King Bar or doesn't have his Linken's Sphere.", "Blade Mail can be activated under Midnight Pulse or Black Hole to inflict that damage back to Enigma.", "Spirit Vessel comes handy at diminishing his healing capabilities to single out him. Early game he can carry a Mekansm then at late game he can branch towards an Octarine Core.", "Abyssal Blade's stun and bash can pierce through Enigma's Black King Bar. However, it has extremely short range, and approaching Enigma while he is Spell Immune and channeling Black Hole is a very bad idea."], "Clockwerk": ["Medallion of Courage will allow enemies to quickly kill Clockwerk, making his initiation short-lived.", "Force Staff can push trapped enemies out of Power Cogs, and Hurricane Pike can also do this while pushing Clockwerk on the other side of the cogs.", "Eul's Scepter of Divinity will keep enemies safe from Clockwerk until Power Cogs go down."], "Timbersaw": ["Spirit Vessel reduces the amount of healing Timbersaw receives from Reactive Armor.", "Orchid Malevolence's silence negates Timbersaw's mobility and damage. This can also be upgraded into a Bloodthorn to help punch through his high armor.", "Black King Bar is a good pickup for carries, as none of his abilities go through Avatar.", "Scythe of Vyse is an effective way of silencing Timbersaw, as its cast time is instantaneous and difficult to be reacted against.", "Diffusal Blade drains Timbersaw's mana, negating nearly all of his strengths by removing his abilities.", "Silver Edge breaks Reactive Armor's passive bonuses, preventing Timbersaw from building up stacks. Note that this will not remove any stacks that he has already obtained."], "Troll_Warlord": ["Blade Mail is especially effective against Troll Warlord, due to Troll Warlord's high physical damage and low health pool.", "Silver Edge can break Troll Warlord's Fervor and passive root, mitigating most of Troll Warlord's threat.", "Heaven's Halberd disarms Troll Warlord, negating all of his attack damage and root. Heaven's Halberd is especially effective if Troll Warlord is in ranged form, due to the increased duration of the disarm.", "Bloodthorn can be effective against Troll Warlord, as all attacks on the Bloodthorn silenced target will have True Strike.", "Scythe of Vyse can be useful both offensively and defensively - disabling and preventing him from either killing or running away."], "Alchemist": ["Assault Cuirass reduces Alchemist's physical survivability and his teammates.", "Shiva's Guard does the same thing as Assault Cuirass but it also reduces the attack speed, reducing the effectiveness of Chemical Rage.", "Heaven's Halberd applies an undispellable disarm so Alchemist cannot attack during Chemical Rage, forcing him to activate Black King Bar beforehand.", "Scythe of Vyse disables Alchemist, making sure he won't be able to use his Chemical Rage to heal up, and allows heroes to burst him down fast.", "Spirit Vessel reduces Alchemist's health regeneration."], "Legion_Commander": ["Ghost Scepter stops Legion Commander from attacking during Duels, but has to be used beforehand and doesn't last as long as the Duel itself.", "Ethereal Blade stops Legion Commander from attacking during Duels but just like Ghost Scepter, doesn't last as long as the duel.", "Heaven's Halberd stops Legion Commander from attacking during Duels, and gives its owner evasion even after the active ability ends.", "Eul's Scepter of Divinity interrupts Duels and dispels the buffs from Press the Attack and Overwhelming Odds.", "Linken's Sphere prevents Legion Commander from initiating Duels. This negates her ability to gank targets by herself, forcing her to stick with her allies.", "Solar Crest's buff protect both its owner and their allies from being killed in Duels. It can also be used on Legion Commander to give an allied opponent the advantage.", "Blade Mail can cause Legion Commander to take more damage than her target, especially if she has won many previous Duels.", "Mekansm makes it harder for Legion Commander to kill an allied opponent.", "Aeon Disk stops Legion Commander from killing opponents during Duels.", "Satanic provides lifesteal and its active helps its carriers to survive or can even helping the carriers to win Duels, if timed correctly."], "Night_Stalker": ["Town Portal Scroll is an easy way to escape Night Stalker after Void is used.", "Manta Style dispels Void's slow, as well as creating illusions that can waste his single-target abilities.", "Lotus Orb sends Void's slow back to him or removes the debuff from an ally.", "Linken's Sphere prevents Void's slow and damage.", "Force Staff brings targets out of Crippling Fear's area.", "Ghost Scepter or Ethereal Blade prevents Night Stalker attacking on you or ally.", "Eul's Scepter of Divinity wastes Night Stalker's Crippling Fear duration.", "Silver Edge breaks Hunter of the Night.", "Black King Bar provides spell immunity, making Crippling Fear and Void useless."], "Doom": ["Mekansm and Guardian Greaves provide burst-healing to allies, which is particularly effective against Doom and his damage-over-time abilities.", "Linken's Sphere can block Doom. Doom's only inherit means of breaking the Linken's Sphere is through his Infernal Blade. An initiation created with Infernal Blade followed up by Doom takes a lengthy amount of time, and can potentially allow the enemy team to react.", "A Lotus Orb applied at the right time can reflect Doom back onto himself.", "A Glimmer Cape can be used to protect an ally from the magical damage from both Infernal Blade and Scorched Earth, and can potentially allow the ally to escape Doom's grasp.", "Orchid Malevolence is an effective means of preventing Doom from initiating and casting his abilities during a fight, which he is highly reliant on to deal damage."], "Lich": ["Glimmer Cape, Shadow Amulet, Shadow Blade, Silver Edge allow users to escape Chain Frost.", "Teams with multiple Blade Mails may cause Lich to accidentally kill himself with Chain Frost.", "Pipe of Insight can block most of Chain Frost's damage.", "Black King Bar will make the user immune to Lich's spell casting.", "Manta Style will reduce the effectiveness of Chain Frost. Manta Style will also dispel any slow Lich may have applied to the target.", "Eul's Scepter of Divinity will remove Frost Shield from Lich or his allies.", "Force Staff can be a good pickup versus Lich as all he does is to slow you. The push it gives can be enough to catchup with him or run away.", "Linken's Sphere blocks Chain Frost upon impact."], "Viper": ["Town Portal Scroll allows heroes to escape from Viper, as he cannot interrupt it nor kill a healthy hero before they teleport.", "Black King Bar nullifies most of Viper's arsenal.", "Blink Dagger can be used to take advantage of Viper's low mobility, but his damage over time makes it unreliable as an escape tool.", "Ghost Scepter and Ethereal Blade protect against Viper's attacks.", "Glimmer Cape's invisibility prevents Viper from attacking the target, and the magic resistance counteracts Viper's damage over time.", "Force Staff can allow a hero to escape while slowed by Viper.", "Silver Edge's break disables Corrosive Skin, making him weaker even against the heroes he naturally counters.", "Manta Style disjoints Viper Strike and can make Viper waste time attacking illusions.", "Diffusal Blade can slow Viper with its active ability and pin him down while burning his mana.", "Linken's Sphere blocks Viper Strike, and Viper has no other ways to break the Spell Block. In addition, Viper hates buying disabling items.", "Lotus Orb can reflect Viper Strike."], "Shadow_Demon": ["Eul's Scepter of Divinity and Lotus Orb can dispel Shadow Poison and Soul Catcher. A well-timed Lotus Orb can also reflect Disruption and Demonic Purge.", "Manta Style dispels Shadow Poison and Soul Catcher. However, it can also mark the real hero affected from Demonic Purge.", "Linken's Sphere blocks Disruption and Demonic Purge.", "Force Staff can save an ally or the victim himself if he is able to force through a cliff to the high ground, or create enough distance to retreat into a foggy area.", "Town Portal Scroll can help a victim survive an early solo gank attempt from Shadow Demon since he usually initiates with a Disruption and has no way to cancel the teleport afterward, while Shadow Poison needs time to stack up and Demonic Purge only deals damage after a lengthy delay."], "Gyrocopter": ["Blade Mail will reflect damage from Flak Cannon, which Gyrocopter cannot avoid hitting.", "Black King Bar negates Gyrocopter's magic damage.", "Crimson Guard reduces much of the damage from Flak Cannon.", "Assault Cuirass reduces the amount of area damage from Flak Cannon."], "Faceless_Void": ["Aeon Disk will prevent damage taken for a while, which may keep the wielder alive during Chronosphere.", "Orchid Malevolence can render Faceless Void unable to use his abilities in a team fight or prevent him from escaping a chase.", "Scythe of Vyse prevents Faceless Void from casting any spells or items as well as attacking, a more reliable version of Orchid Malevolence.", "Eul's Scepter of Divinity on Faceless Void can stop him from attaking in his Chronosphere, protecting whoever he trapped inside. Same goes for preemptive cast and Wind Waker from a teammate.", "Crimson Guard can help prevent allies from getting killed in Chronosphere.", "Ethereal Blade can cast on allies to prevent from getting attacked in Chronosphere.", "Blade Mail can kill void from getting chronosphere."], "Huskar": ["Black King Bar negates the magical damage from Burning Spears and Inner Fire unless the level 25 talent for Burning Spears is chosen.", "Pipe of Insight will both reduce and/or block the damage dealt by Burning Spears and Life Break, which greatly reduces Huskar's damage output.", "Silver Edge will break Berserker's Blood, making it much easier to burst down Huskar while also reducing his damage.", "Heaven's Halberd stops Huskar from attacking and applying Burning Spears.", "Linken's Sphere blocks Life Break.", "Spirit Vessel disables most of Berserker's Blood health regeneration.", "Manta Style can dodge Life Break's damage if timed correctly. Huskar isn't great at dealing with illusions as well.", "Shiva's Guard applies health regen reduction and lifesteal reduction.", "Eye of Skadi can reduce the health regeneration and lifesteal of Huskar. It can also slightly reduce the attack speed of Huskar."], "Dark_Seer": ["Orchid Malevolence prevents Dark Seer from using Surge and running away.", "Blade Mail can deal much damage to Dark Seer if he uses his Ion Shell on a creep.", "Eul's Scepter of Divinity can dispel Ion Shell and Surge."], "Lycan": ["Town Portal Scroll is rather efficient against Lycan, as he lacks disables to stop a teleporting Hero from escaping.", "Or if he is split-pushing a lane, this might make him turn around. If not, stay alert as he might dive.", "Heaven's Halberd is a good counter to attacks, on which Lycan heavily relies.", "Blade Mail's return damage might cause Lycan to stop attacking his victim. If not, Lycan will take loads of returned damage.", "Ghost Scepter and Ethereal Blade prevents the user from taking physical damage. Lycan is mainly a physical damage dealer.", "Rod of Atos limits Lycan's mobility during his ultimate.", "Crimson Guard reduces the damage taken from Lycan's units and drastically improves how long a tower survives his push."], "Arc_Warden": ["Black King Bar negates Arc Warden's mostly magical damage.", "Lotus Orb usually reflects most of Arc Warden's frequently built items back onto him.", "Monkey King Bar allows enemies to attack Arc Warden through Magnetic Field.", "Manta Style can dispel Flux, frequently bought Orchid Malevolence and makes Spark Wraith much less effective."], "Crystal_Maiden": ["Black King Bar and other sources of magical immunity/reduction make Crystal Maiden nearly irrelevant, preventing her from using her abilities or Freezing Field from dealing its damage or slow. These items make it easy for enemy heroes to kill her off quickly — even in her ultimate.", "Skull Basher and other sources of bash are very problematic for Crystal Maiden, because even if she owns a Black King Bar, the stun will pierce it and cancel her ultimate.", "Orchid Malevolence and Bloodthorn are an issue for Crystal Maiden in the same way that they are for any spell based hero: if she can't use her abilities due to a silence, her fight impact is greatly reduced.", "Abyssal Blade's stun not only lets the caster blinks on Crystal Maiden but also it pierces spell immunity.", "Blade Mail reflects Freezing Field, doing incredible damage to Crystal Maiden when she uses her ultimate. Due to her low health pool, this can quickly spell her doom, so heroes who build Blade Mail (like Axe, Clockwerk, or Bristleback) can be incredibly problematic."], "Tiny": ["Black King Bar completely cancels Tiny's burst potential if the enemy are quick enough to activate it.", "Desolator and Assault Cuirass reduce Tiny's already very low armor, making him very vulnerable to physical damage.", "Shiva's Guard reduces Tiny's already low attack Speed and its active helps to kite him in a fight."], "Keeper_of_the_Light": ["Blade Mail can reflect Keeper of the Light's damage back to him.", "Eul's Scepter of Divinity can dispel Blinding Light.", "Lotus Orb can dispel Blinding Light.", "Black King Bar blocks all of Keeper of the Light's abilities."], "Kunkka": ["Crimson Guard will protect against much of Kunkka's damage early on.", "Black King Bar negates all of Kunkka's spell damage, and negates X Marks the Spot.", "Eul's Scepter of Divinity negates X Marks the Spot both on allies and enemies, if timed correctly."], "Ancient_Apparition": ["Cloak and its upgrades reduce damage from all of Ancient Apparition's abilities.", "Hood of Defiance and Pipe of Insight both can prevent damage from Ice Blast with their active abilities, and passive magic resistance.", "Black King Bar dispels Cold Feet and prevents damage from Ancient Apparition's abilities, with the exception of Ice Blast.", "Force Staff/ Hurricane Pike can be used to escape Ancient Apparition abilities.", "Shadow Blade/ Silver Edge makes it hard to catch the hero with Ice Blast.", "Manta Style dispels the Cold Feet debuff.", "Essence Ring increases the hero's health above the shatter threshold."], "Drow_Ranger": ["Blink Dagger allows for heroes to close the gap on Drow Ranger and cancel her Marksmanship.", "Blade Mail punishes Drow Ranger's high attack damage and attack speed by returning her damage.", "Black King Bar prevents silence from Gust.", "Heaven's Halberd disarms Drow Ranger, shutting off her only damage source.", "Manta Style dispels the silence from Gust.", "Eul's Scepter of Divinity dispels the silence from Gust.", "Rod of Atos's large cast range makes gap-closing a lot easier.", "Shadow Blade lets heroes easily ambush Drow Ranger from close range. Its upgrade, Silver Edge, can also break Precision Aura."], "Warlock": ["Orchid Malevolence silences Warlock, which is bad for him as a spell based hero.", "Diffusal Blade removes mana from Warlock with each attack. Considering the high mana costs of his spells, it could leave him with no room for casting additional spells.", "Eul's Scepter of Divinity can stop Warlock from casting Upheaval, which can then allow the enemy team to escape, or get close to deal damage.", "Blink Dagger can allow heroes to escape from Upheaval and get close to Warlock."], "Shadow_Fiend": ["Eul's Scepter of Divinity interrupts Requiem of Souls, or allows the user to dodge it.", "Orchid Malevolence and Bloodthorn interrupt Requiem of Souls and silences Shadow Fiend.", "Scythe of Vyse and Abyssal Blade interrupt Requiem of Souls and disables Shadow Fiend.", "Assault Cuirass mitigates Presence of the Dark Lord and Shadow Fiend's high physical damage."], "Disruptor": ["Black King Bar makes Disruptor's Kinetic Field-Static Storm combo useless until he gets an Aghanim's Scepter.", "Linken's Sphere prevents Disruptor from using Glimpse to pull you out of position.", "Lotus Orb reflects Thunder Strike and Glimpse.", "Manta Style dispels Thunder Strike and to dodge Glimpse.", "Hood of Defiance upgraded to Pipe of Insight reduces damage from all of Disruptor's spells with the barrier and healing."], "Jakiro": ["Black King Bar negates all of Jakiro's spells.", "Orchid Malevolence can render Jakiro useless in a team fight.", "Pipe of Insight greatly reduces damage from Jakiro's spells due to the extra magic resistance it provides."], "Centaur_Warrunner": ["Radiance prevents Centaur Warrunner from blinking, forcing him to use Stampede.", "Black King Bar, if used well, will save a victim from Centaur Warrunner's onslaught.", "Rod of Atos can root a hero during Stampede."], "Enchantress": ["Blade Mail can turn Impetus against Enchantress since she has a low HP pool.", "Spirit Vessel lowers the amount of healing received by Enchantress and her allies from Nature's Attendants.", "Silver Edge breaks Untouchable for a couple of seconds.", "Shiva's Guard reduces the amount of healing received from Nature's Attendants. The active also slows down Enchantress."], "Sven": ["Force Staff and Hurricane Pike are used to kite Sven, also can save allies from Storm Hammer.", "Blink Dagger disjoints Storm Hammer in quick hands.", "Ghost Scepter and Ethereal Blade allow for great control of the Sven. As a strength hero Sven seldom builds Nullifier.", "Heaven's Halberd neuters Sven's main damage source during a teamfight.", "Rod of Atos roots the Sven to the ground making him an easy target.", "Blade Mail reflects Sven's massive damage, recommended for beefy heroes or in combination with Heart of Tarrasque.", "Scythe of Vyse disables Sven completely.", "Linken's Sphere negates Sven's initiations with Storm Hammer.", "Radiance make Sven miss attacks without Monkey King Bar.", "Abyssal Blade disables Sven even with spell immunity."], "Silencer": ["Manta Style dispels most debuffs when used.", "Guardian Greaves dispels all Silencer's debuffs and restores lost health and mana.", "Black King Bar removes all Silencer's debuffs upon activation and prevents damage from Glaives of Wisdom (outside Silencer's Aghanim upgrade.", "Eul's Scepter of Divinity can be used to disable Silencer for a moment or dispel Silencer's debuffs from you. It also gives nice movement speed and mana regen boosts, which can come in handy.", "Lotus Orb removes all Silencer's debuffs from the targeted ally. Echo Shell can also reflect Last Word back to Silencer, preventing him from casting or using Glaives of Wisdom.", "Orchid Malevolence and Bloodthorn can silence Silencer, preventing him from casting Global Silence when needed or using Glaives of Wisdom. It also increases the damage Silencer takes from attacks making him easier to kill. With Global Silence out of the way, a fight will be much more in your team's favor.", "Blade Mail If Silencer has a lot of intelligence, Glaives of Wisdom will deal lots of damage. Silencer himself, however, is rather squishy and will often lose more than half of his health with just a few attacks if he attacks target with Blade Mail. Blade Mail is good especially on high hp heroes like Pudge, Centaur Warrunner or Ogre Magi."], "Earthshaker": ["Pipe of Insight or Black King Bar significantly reduce Earthshaker's damage output.", "Radiance prevents Earthshaker from using Blink Dagger.", "Eul's Scepter of Divinity wastes Earthshaker while blinking in and to dodge all of his abilities.", "Rod of Atos or Scythe of Vyse prevents Earthshaker escaping from upgraded Enchant Totem.", "Diffusal Blade will wear down Earthshaker's low mana pool.", "Silver Edge can break Aftershock."], "Witch_Doctor": ["Black King Bar protects against Paralyzing Cask's stun and Maledict's damage.", "Lotus Orb reflects Paralyzing Cask.", "Eul's Scepter of Divinity is able to cancel the channeling of Death Ward. It can also be used to dodge Paralyzing Cask."], "Beastmaster": ["Linken's Sphere blocks Primal Roar, making Beastmaster much less useful.", "Aeon Disk's passive automatically dispels Primal Roar's stun.", "Battle Fury's cleave clears out Beastmaster's summons in no time.", "Maelstrom and Mjollnir can clear Beastmaster's summons."], "Axe": ["Eul's Scepter of Divinity wastes the duration of Berserker's Call when used on Axe.", "Vladmir's Offering and Satanic's lifesteal makes it impossible for Axe to kill enemies with Culling Blade", "Force Staff can help dodge a Berserker's Call, or push an ally out of its radius.", "Silver Edge breaks Counter Helix.", "Mekansm keeps allies' health above Culling Blade's threshold, and can be used at the last moment to bait Axe into an overly long initiation.", "Ethereal Blade can be used on an Axe to prevent any allied unit from attacking him."], "Razor": ["Town Portal Scroll transports the user away from Razor as he has no way to interrupt the channeling.", "Linken's Sphere blocks Static Link and Razor has no other tools to pop it.", "Lotus Orb reflects Static Link, wasting its cooldown for a long time.", "Force Staff and Hurricane Pike are easy tools to break Static Link."], "Lifestealer": ["Force Staff is very useful to kite Lifestealer in team-fight.", "Orchid Malevolence If placed before Rage will make Lifestealer unable to use his abilities in a teamfight.", "Manta Style Lifestealer has no way of dealing with illusions and the extra damage from the illusions can damage him more than he can heal.", "Heaven's Halberd gives evasion and an undispellable disarm, making Lifestealer useless if placed before Rage.", "Medallion of Courage or Solar Crest, Assault Cuirass, and other armor items are useful against Lifestealer's physical-only damage.", "Silver Edge breaks Feast and gives an escape tool."], "Lone_Druid": ["Ghost Scepter protects from Lone Druid's and his bear's attacks while he has no dispels or magic damage.", "Heaven's Halberd prevent the spirit bear from attacking, reducing Lone Druid's main damage output for a decent time."], "Queen_of_Pain": ["Blade Mail can reflect all her nukes, especially Sonic Wave.", "Orchid Malevolence silences her, preventing her from escaping or releasing her magic burst. It can later be upgraded to Bloodthorn, which allows anyone to make short work of her.", "Rod of Atos prevents Queen of Pain from escaping or initiating.", "Scythe of Vyse and Abyssal Blade have instant disables."], "Dazzle": ["Orchid Malevolence and Bloodthorn can silence Dazzle, either to kill him or block his spells in critical moments. This forces Dazzle to spend his meager support farm on expensive Eul's Scepter, Lotus Orb, or Guardian Greaves.", "Diffusal Blade burn Dazzle's mana quickly, rendering him useless.", "Dagon along with other quick nukes can snipe low-health allies before Shallow Grave's long cast animation completes.", "Eul's Scepter of Divinity can be used to", "Cyclone an enemy affected by Shallow Grave, wasting a large part of the duration, and giving time to zone Dazzle away so he can't help any more", "Cyclone Dazzle at a crucial point, preventing him from helping his allies", "Kill an almost-dead enemy who has been Shallow Graved, thanks to the small 50 damage inflicted on landing."], "Sand_King": ["Black King Bar ignores all Sand King's abilities.", "Dust of Appearance, Gem of True Sight and Sentry Wards reveal him through Sand Storm.", "Orchid Malevolence silences, preventing Sand King from casting spells. It might as well cancel Epicenter channeling and waste its mana and putting it on cooldown without applying its effects.", "Linken's Sphere can block Burrowstrike, Sand King's only inherent disable.", "Lotus Orb will reflect Sand King's Burrowstrike.", "Blade Mail will reflect Sand King's Epicenter possible killing Sand King."], "Slardar": ["Given that Slardar's damage output is entirely physical, there is almost nothing he can do when enemies activate Ghost Scepter.", "Shiva's Guard provides armor which helps against Slardar, while the passive attack slow also prevents him from attacking as often.", "Radiance, Butterfly, Heaven's Halberd, Solar Crest can reduce the value of your Corrosive Haze with constant misses and can be hard for Slardar to itemize against, requiring Black King Bar, Monkey King Bar or both. The same applies for his allies that want to take advantage of the armor reduction.", "Diffusal Blade can be a pain to deal with until Slardar gets a Black King Bar."], "Shadow_Shaman": ["An enemy armed with Phase Boots can escape a ring of Mass Serpent Wards if trapped.", "Force Staff escapes from Mass Serpent Ward but not from Shackles.", "Lotus Orb reflects Hex and Shackles.", "Linken's Sphere prevents Hex and Shackles, although Shadow Shaman can simply use his toolset to pop it out.", "Dragon Lance allows ranged heroes to safely destroy Mass Serpent Wards from a distance.", "Abyssal Blade's stun is the base way to interrupt Shackles."], "Naga_Siren": ["Blade Mail can be used when you are rooted by her Ensnare, returning all the damage she and her illusions deal to you while you're disabled.", "Ghost Scepter prevents you from taking damage from her and her illusions' attacks (although you will still take damage from her Rip Tide, if Naga Siren targets others near you).", "Battle Fury and Maelstrom (and later Mjollnir or Gleipnir) can clear illusions with their area damage."], "Tinker": ["Blade Mail can reflect a lot of damage back to Tinker, especially while using March of the Machines.", "Linken's Sphere prevents Tinker from using Laser and his targeted items.", "Black King Bar makes all of Tinker's spells and items useless, because they are all magical and don't penetrate spell immunity.", "Lotus Orb reflects his spells and items back onto himself."], "Necrophos": ["Spirit Vessel prevents Necrophos from getting too much health from his abilities.", "Shiva's Guard provides an aura that reduces all heals and regen.", "Nullifier renders Ghost Shroud completely ineffective during its duration.", "Lotus Orb reflects Reaper's Scythe back to Necrophos. Most of the time his ultimate will not kill him back as he'd be casting it mostly at full health, but it does mean Necrophos will be stunned through spell immunity for 1.5 seconds, preventing him from possibly following up his ultimate with more of his own damage.", "Linken's Sphere makes it impossible to cast Reaper's Scythe on a target if there are no other abilities that can waste it.", "Black King Bar ignores the damage from most of Necrophos' abilities, especially that of his ultimate.", "Orchid Malevolence and Bloodthorn prevents Necrophos from spamming Death Pulse, preventing him from healing back and/or retaliating, and Ghost Shroud to defend himself.", "Scythe of Vyse is a stronger counter than the above mentioned items, preventing not only his abilities from being cast, but also his items that could either heal him further, dispel the debuffs, or help him escape.", "Silver Edge disables Heartstopper Aura, which reduces his presence in fights. Already existing stacks of Hearstopper Aura still provide bonus health and mana regeneration.", "Dagon deals to Necrophos massive damage when he using Ghost Shroud and with Ethereal Blade he get mostly killed in seconds.", "Diffusal Blade slows and drains Necrophos' mana."], "Ogre_Magi": ["Magic resistance items, such as Black King Bar and Pipe of Insight reduce Ogre Magi's damage output.", "Orchid Malevolence and Hurricane Pike makes Ogre Magi completely useless.", "Silver Edge can break Multicast.", "Manta Style dispels Ignite.", "Lotus Orb reflects Fireblast and Ignite."], "Vengeful_Spirit": ["Linken's Sphere blocks Magic Missile or Nether Swap.", "Diffusal Blade burns Vengeful Spirit's low mana.", "Lotus Orb reflects Magic Missile or Nether Swap.", "Assault Cuirass provides armor for everyone within its aura radius, significantly reducing the bonus damage provided by Vengeful Spirit's Vengeance Aura as well as the armor reduction from Wave of Terror.", "Silver Edge disables Vengeance Aura."], "Treant_Protector": ["Gem of True Sight reveals all trees buffed with Eyes In The Forest, as well as Treant Protector himself.", "Tango is readily available and can be bought in bulk to remove trees by consuming them.", "Quelling Blade and its upgrade, Battle Fury, chop down trees.", "Force Staff and its upgrade, Hurricane Pike, can also clear trees in a linear fashion.", "Treant Protector's abilities are dispellable with any dispel, so items such as Manta Style and Guardian Greaves are very effective against him.", "Sentry Ward prevents any invisible gank coming from Treant Protector."], "Death_Prophet": ["Blade Mail can reflect Exorcism's damage when active. Since Exorcism will continue to do damage as long as it is active or until you are dead there is no way to stop someone from using Blade Mail's active to harm you using your spirits.", "Orchid Malevolence and Bloodthorn can temporarily stop Death Prophet from casting spells, which renders Death Prophet useless during fights.", "Diffusal Blade can slow her down and drain her mana while attacking.", "Eul's Scepter of Divinity, Guardian Greaves, Lotus Orb, Manta Style can easily dispel Death Prophet's silence."]}